Revit 2026 API

# IFrameworkElementCreator Interface

---

Interface that the Revit UI will call, if present, to construct the FrameworkElement for the pane.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IFrameworkElementCreator
```
```vb
Public Interface IFrameworkElementCreator
```
```cpp
public interface class IFrameworkElementCreator
```
```fsharp
type IFrameworkElementCreator = interface end
```

The IFrameworkElementCreator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateFrameworkElement | Method called to create the FrameworkElement. |

#### Reference

Autodesk.Revit.UI Namespace